In [161]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006], 
                   "date":pd.date_range('20130102', periods=6),
                   "city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
                   "age":[23,44,54,32,34,32],
                   "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
                   "price":[1200,np.nan,2133,5433,np.nan,4432]},
                   columns =['id','date','city','category','age','price'])

In [162]:
df

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

##数据表检查

#查看数据表的维度

In [163]:
#查看数据表维度
df.shape

(6, 6)

In [164]:
#查看数据表信息
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
id          6 non-null int64
date        6 non-null datetime64[ns]
city        6 non-null object
category    6 non-null object
age         6 non-null int64
price       4 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 368.0+ bytes

In [165]:
#查看数据表各列格式
df.dtypes

id                   int64
date        datetime64[ns]
city                object
category            object
age                  int64
price              float64
dtype: object

In [166]:
#查看单列格式
df['price'].dtype

dtype('float64')

In [167]:
#检查数据空值
df.isnull()

      id   date   city category    age  price
0  False  False  False    False  False  False
1  False  False  False    False  False   True
2  False  False  False    False  False  False
3  False  False  False    False  False  False
4  False  False  False    False  False   True
5  False  False  False    False  False  False

In [168]:
#检查特定列空值
df['city'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
Name: city, dtype: bool

In [169]:
#查看city列中的唯一值------------------------------------
df['city'].unique()

array(['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '], dtype=object)

In [170]:
#查看数据表的值
df.values

array([[1001, Timestamp('2013-01-02 00:00:00'), 'Beijing ', '100-A', 23,
        1200.0],
       [1002, Timestamp('2013-01-03 00:00:00'), 'SH', '100-B', 44, nan],
       [1003, Timestamp('2013-01-04 00:00:00'), ' guangzhou ', '110-A', 54,
        2133.0],
       [1004, Timestamp('2013-01-05 00:00:00'), 'Shenzhen', '110-C', 32,
        5433.0],
       [1005, Timestamp('2013-01-06 00:00:00'), 'shanghai', '210-A', 34,
        nan],
       [1006, Timestamp('2013-01-07 00:00:00'), 'BEIJING ', '130-F', 32,
        4432.0]], dtype=object)

In [171]:
#查看列名称
df.columns

Index(['id', 'date', 'city', 'category', 'age', 'price'], dtype='object')

In [172]:
#查看前3行数据
df.head(3)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0

In [173]:
#查看最后3行
df.tail(3)

     id       date      city category  age   price
3  1004 2013-01-05  Shenzhen    110-C   32  5433.0
4  1005 2013-01-06  shanghai    210-A   34     NaN
5  1006 2013-01-07  BEIJING     130-F   32  4432.0

In [174]:
#删除数据表中含有空值的行
df.dropna(how = 'any')

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [175]:
#使用数字0填充数据表中空值
df.fillna(0)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     0.0
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     0.0
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [176]:
#使用price均值对NA进行填充
#需要注意fillna方法返回的是一个DataFrame,不是一列数字,若要修改数据,需要赋值给DataFrame,而不是某一列
df = df.fillna(value = df['price'].mean())

In [177]:
#清除city字段中的字符空格
df['city'].map(str.strip)

0      Beijing
1           SH
2    guangzhou
3     Shenzhen
4     shanghai
5      BEIJING
Name: city, dtype: object

In [178]:
#假设str是一个字符串
#那么str.strip()就是把这个字符串头和尾的空格，以及位于头尾的\n \t之类给删掉。
#http://blog.csdn.net/u012671171/article/details/52024874
a = ' where are where '
b = a.strip()
c = a.strip('where')
print (a)
print (b)
print (c)

 where are where
where are where
 where are where

In [179]:
#city列大小写转换
df['city'].map(str.lower)
df['city'] = df['city'].map(str.title)

In [180]:
#更改price列数据格式
#需要注意fillna方法返回的是一个DataFrame,不是一列数字,若要修改数据,需要赋值给DataFrame,而不是某一列
df['price'].astype('int')

0    1200
1    3299
2    2133
3    5433
4    3299
5    4432
Name: price, dtype: int32

In [181]:
#更改列名称
df.rename(columns = {'category':'category-size'})

     id       date         city category-size  age   price
0  1001 2013-01-02     Beijing          100-A   23  1200.0
1  1002 2013-01-03           Sh         100-B   44  3299.5
2  1003 2013-01-04   Guangzhou          110-A   54  2133.0
3  1004 2013-01-05     Shenzhen         110-C   32  5433.0
4  1005 2013-01-06     Shanghai         210-A   34  3299.5
5  1006 2013-01-07     Beijing          130-F   32  4432.0

In [182]:
#删除city列后出现的重复值
df['city'].drop_duplicates()

0       Beijing
1             Sh
2     Guangzhou
3       Shenzhen
4       Shanghai
Name: city, dtype: object

In [183]:
#删除city列先出现的重复值
df['city'].drop_duplicates(keep = 'last')

1             Sh
2     Guangzhou
3       Shenzhen
4       Shanghai
5       Beijing
Name: city, dtype: object

In [184]:
#数据替换,将city列中sh替换为shanghai
df['city'].replace('Sh','shanghai')

0       Beijing
1       shanghai
2     Guangzhou
3       Shenzhen
4       Shanghai
5       Beijing
Name: city, dtype: object

## 数据预处理

In [185]:
df1=pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006,1007,1008], 
                  "gender":['male','female','male','female','male','female','male','female'],
                  "pay":['Y','N','Y','Y','N','Y','N','Y',],
                  "m-point":[10,12,20,40,40,40,30,20]})

In [186]:
#数据表df和df1匹配合并-inner方式,并将结果赋值给df_inner
#方法中的how参数可以省略,简写为pd.merge(df,df1,'inner')
df_inner = pd.merge(df,df1,how = 'inner')
df_inner

     id       date         city category  age   price  gender  m-point pay
0  1001 2013-01-02     Beijing     100-A   23  1200.0    male       10   Y
1  1002 2013-01-03           Sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04   Guangzhou     110-A   54  2133.0    male       20   Y
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0  female       40   Y
4  1005 2013-01-06     Shanghai    210-A   34  3299.5    male       40   N
5  1006 2013-01-07     Beijing     130-F   32  4432.0  female       40   Y

In [187]:
#尝试用left,right.outer方式合并数据,分别赋值给df_left,df_right,df_outer
df_left = pd.merge(df,df1,'left')
df_left

     id       date         city category  age   price  gender  m-point pay
0  1001 2013-01-02     Beijing     100-A   23  1200.0    male       10   Y
1  1002 2013-01-03           Sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04   Guangzhou     110-A   54  2133.0    male       20   Y
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0  female       40   Y
4  1005 2013-01-06     Shanghai    210-A   34  3299.5    male       40   N
5  1006 2013-01-07     Beijing     130-F   32  4432.0  female       40   Y

In [188]:
#为df_inner设置索引列为id
df_inner.set_index('id')

           date         city category  age   price  gender  m-point pay
id
1001 2013-01-02     Beijing     100-A   23  1200.0    male       10   Y
1002 2013-01-03           Sh    100-B   44  3299.5  female       12   N
1003 2013-01-04   Guangzhou     110-A   54  2133.0    male       20   Y
1004 2013-01-05     Shenzhen    110-C   32  5433.0  female       40   Y
1005 2013-01-06     Shanghai    210-A   34  3299.5    male       40   N
1006 2013-01-07     Beijing     130-F   32  4432.0  female       40   Y

In [189]:
#按age列进行排序
df_inner.sort_values('age')

     id       date         city category  age   price  gender  m-point pay
0  1001 2013-01-02     Beijing     100-A   23  1200.0    male       10   Y
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0  female       40   Y
5  1006 2013-01-07     Beijing     130-F   32  4432.0  female       40   Y
4  1005 2013-01-06     Shanghai    210-A   34  3299.5    male       40   N
1  1002 2013-01-03           Sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04   Guangzhou     110-A   54  2133.0    male       20   Y

In [190]:
#按索引列排序
df_inner.sort_index()

     id       date         city category  age   price  gender  m-point pay
0  1001 2013-01-02     Beijing     100-A   23  1200.0    male       10   Y
1  1002 2013-01-03           Sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04   Guangzhou     110-A   54  2133.0    male       20   Y
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0  female       40   Y
4  1005 2013-01-06     Shanghai    210-A   34  3299.5    male       40   N
5  1006 2013-01-07     Beijing     130-F   32  4432.0  female       40   Y

###数据分组

In [191]:
#使用where方法,新建一列group,如果price列的值>3000，group列显示high，否则显示low
df_inner['group'] = np.where(df_inner['price']>3000,'high','low')
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group
0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low
1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high
2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low
3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,40,Y,high
4,1005,2013-01-06,Shanghai,210-A,34,3299.5,male,40,N,high
5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high

In [192]:
#使用loc方法,新建sign列,如果price列的值>4000且city列=='beijing',则标记为1
#df.loc的第一个参数是行标签，第二个参数为列标签（可选参数，默认为所有列标签），两个参数既可以是列表也可以是单个字符，如果两个参数都为列表则返回的是DataFrame，否则，则为Series。
#http://blog.csdn.net/chixujohnny/article/details/51095817

df_inner.loc[(df_inner['city'] == 'Beijing')&(df_inner['price']>=4000),'sign'] = 1
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign
0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN
1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high,NaN
2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN
3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,40,Y,high,NaN
4,1005,2013-01-06,Shanghai,210-A,34,3299.5,male,40,N,high,NaN
5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high,NaN

###数据分列

In [193]:
#对category字段的值依次进行分列，并创建数据表，索引值为df_inner的索引列，列名称为category和size
#实际上下面这段代码是创建了一个dataframe,含有三个参数,第一个为数值,第二个为index,第三个为列名称
temp = pd.DataFrame([x.split('-') for x in df_inner['category']],index = df_inner.index,columns = ['a','b'])

In [194]:
pd.DataFrame([(x,x**2) for x in range(3)],columns = ['a','b'],index = ['yi','er','san'])

     a  b
yi   0  0
er   1  1
san  2  4

In [195]:
#

In [196]:
#将完成分列后的数据表与原df_inner数据表进行匹配
#concat([df1,df2],axis=1) 等价于 merge(df1,df2,left_index=True,right_index=True,how='outer')
#http://blog.csdn.net/u010414589/article/details/51135840
#http://blog.csdn.net/zutsoft/article/details/51498026
df_inner = pd.merge(df_inner,temp,right_index = True,left_index = True)
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,1005,2013-01-06,Shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F

##数据提取

###按标签提取(loc)

In [197]:
#按索引提取单行的数值
#可以看到loc方法用的index是包含的,也就是左闭右闭
#第一个参数为行,第二个参数为列,若有多列,用括号扩上
df_inner.loc[:3,('city','price')]

          city   price
0     Beijing   1200.0
1           Sh  3299.5
2   Guangzhou   2133.0
3     Shenzhen  5433.0

In [198]:
#按索引提取区域行数值

In [199]:
#重设索引
#df_inner.reset_index()
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,1005,2013-01-06,Shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F

In [200]:
#设置日期date为索引
df_inner = df_inner.reset_index()
#df_inner = df_inner.set_index('date')
df_inner

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,4,1005,2013-01-06,Shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F

In [201]:
#提取4日2013-01-04之前的所有数据
#注意比较以下三个语句的差别
df_inner[:3]
df_inner.loc[:3]
df_inner.iloc[:3]

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A

In [202]:
#使用iloc按位置区域提取数据
df_inner.iloc[:3,:2]

   index    id
0      0  1001
1      1  1002
2      2  1003

In [203]:
#使用iloc按位置单独提取数据
df_inner.iloc[[0,2,5],[4,5]]

  category  age
0    100-A   23
2    110-A   54
5    130-F   32

In [204]:
#使用ix按索引标签和位置混合提取数据
df_inner.ix[:'2013-01-03',:4]

   index    id       date         city
0      0  1001 2013-01-02     Beijing
1      1  1002 2013-01-03           Sh
2      2  1003 2013-01-04   Guangzhou

###按条件提取

In [205]:
#判断city列的值是否为beijing
df_inner['city'].isin(['beijing'])

0    False
1    False
2    False
3    False
4    False
5    False
Name: city, dtype: bool

In [206]:
#先判断city列里是否包含beijing和shanghai，然后将复合条件的数据提取出来。
df_inner.loc[df_inner['city'].isin(['beijing','shanghai'])]
#df_inner.loc[df_inner['city'].isin(['beijing','shanghai'])]
df_inner

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,4,1005,2013-01-06,Shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F

In [207]:
#将category列密码的数值单独赋值给category
category = pd.DataFrame(df_inner['category'].str[:3])
category

  category
0      100
1      100
2      110
3      110
4      210
5      130

In [208]:
#提取category的前三个字符生成DataFrame
df_inner

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,4,1005,2013-01-06,Shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F

##数据筛选

In [210]:
#使用“与”条件进行筛选
df_inner['city'] = df_inner['city'].map(str.strip)
print (df_inner)
df_inner.loc[(df_inner['price']>1000)&(df_inner['city'] == 'Beijing')]

   index    id       date       city category  age   price  gender  m-point  \
0      0  1001 2013-01-02    Beijing    100-A   23  1200.0    male       10
1      1  1002 2013-01-03         Sh    100-B   44  3299.5  female       12
2      2  1003 2013-01-04  Guangzhou    110-A   54  2133.0    male       20
3      3  1004 2013-01-05   Shenzhen    110-C   32  5433.0  female       40
4      4  1005 2013-01-06   Shanghai    210-A   34  3299.5    male       40
5      5  1006 2013-01-07    Beijing    130-F   32  4432.0  female       40

  pay group  sign    a  b
0   Y   low   NaN  100  A
1   N  high   NaN  100  B
2   Y   low   NaN  110  A
3   Y  high   NaN  110  C
4   N  high   NaN  210  A
5   Y  high   NaN  130  F

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
5,5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F

In [211]:
#使用“或”条件筛选
df_inner.loc[(df_inner['price']>1000)|(df_inner['city'] == 'Beijing')]

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,a,b
0,0,1001,2013-01-02,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,Sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,2,1003,2013-01-04,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,3,1004,2013-01-05,Shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,4,1005,2013-01-06,Shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,5,1006,2013-01-07,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F

In [224]:
#对筛选后的数据按price字段进行求和
df_inner.loc[(df_inner['price']>1000)&(df_inner['city'] == 'Beijing')].group.sum()

'lowhigh'

In [233]:
#使用“非”条件进行筛选
df_inner.loc[(df_inner['price']!=1000)].sort_values('age')

,index,id,city,category,age,price,gender,m-point,pay,group,sign,a,b
date,,,,,,,,,,,,,
2013-01-02,0,1001,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-05,3,1004,Shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
2013-01-07,5,1006,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F
2013-01-06,4,1005,Shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
2013-01-03,1,1002,Sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2013-01-04,2,1003,Guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A

In [236]:
#对筛选后的数据按city列进行计数
df_inner.loc[(df_inner['city'] != 'beijing'), ['id','city','age','category','gender']].sort_values(['id'])

              id       city  age category  gender
date
2013-01-02  1001    Beijing   23    100-A    male
2013-01-03  1002         Sh   44    100-B  female
2013-01-04  1003  Guangzhou   54    110-A    male
2013-01-05  1004   Shenzhen   32    110-C  female
2013-01-06  1005   Shanghai   34    210-A    male
2013-01-07  1006    Beijing   32    130-F  female

In [240]:
#使用query函数进行筛选
df_inner.query('city ==["Beijing"]')

,index,id,city,category,age,price,gender,m-point,pay,group,sign,a,b
date,,,,,,,,,,,,,
2013-01-02,0,1001,Beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-07,5,1006,Beijing,130-F,32,4432.0,female,40,Y,high,NaN,130,F

In [241]:
#对筛选后的结果按price进行求和
df_inner.query('city ==["Beijing"]').price.sum()

5632.0

##分类汇总

In [242]:
#以city列为维度,对所有其他列进行计数汇总
df_inner.groupby('city').count()

,index,id,category,age,price,gender,m-point,pay,group,sign,a,b
city,,,,,,,,,,,,
Beijing,2,2,2,2,2,2,2,2,2,0,2,2
Guangzhou,1,1,1,1,1,1,1,1,1,0,1,1
Sh,1,1,1,1,1,1,1,1,1,0,1,1
Shanghai,1,1,1,1,1,1,1,1,1,0,1,1
Shenzhen,1,1,1,1,1,1,1,1,1,0,1,1

In [247]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006], 
                   "date":pd.date_range('20130102', periods=6),
                   "city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
                   "age":[23,44,54,32,34,32],
                   "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
                   "price":[1200,np.nan,2133,5433,np.nan,4432]},
                   columns =['id','date','city','category','age','price'])
df

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [252]:
df['city'] = df['city'].map(str.strip)
df['city'] = df['city'].map(str.lower)

In [253]:
#对特定的price列进行计数汇总
df.groupby('city')['price'].count()

city
beijing      2
guangzhou    1
sh           0
shanghai     0
shenzhen     1
Name: price, dtype: int64

In [254]:
#对两个字段进行汇总计数
df.groupby(['city','category'])['price'].count()

city       category
beijing    100-A       1
           130-F       1
guangzhou  110-A       1
sh         100-B       0
shanghai   210-A       0
shenzhen   110-C       1
Name: price, dtype: int64

In [255]:
#对city字段进行汇总并计算price的合计和均值。
df.groupby('city')['price'].agg([len,np.sum,np.mean])

           len     sum    mean
city
beijing    2.0  5632.0  2816.0
guangzhou  1.0  2133.0  2133.0
sh         1.0     NaN     NaN
shanghai   1.0     NaN     NaN
shenzhen   1.0  5433.0  5433.0

###数据透视表

In [271]:
#数据透视表
#参数的参考资料:http://python.jobbole.com/81212/
pd.pivot_table(df,columns = ['city'],index = ['date'],values = ['price'],aggfunc = [len,np.sum],fill_value = 0,margins = True)

                        len                                           sum  \
                      price                                         price
city                beijing guangzhou   sh shanghai shenzhen  All beijing
date
2013-01-02 00:00:00     1.0       0.0  0.0      0.0      0.0  1.0  1200.0
2013-01-03 00:00:00     0.0       0.0  1.0      0.0      0.0  NaN     0.0
2013-01-04 00:00:00     0.0       1.0  0.0      0.0      0.0  1.0     0.0
2013-01-05 00:00:00     0.0       0.0  0.0      0.0      1.0  1.0     0.0
2013-01-06 00:00:00     0.0       0.0  0.0      1.0      0.0  NaN     0.0
2013-01-07 00:00:00     1.0       0.0  0.0      0.0      0.0  1.0  4432.0
All                     2.0       1.0  NaN      NaN      1.0  4.0  5632.0



city                guangzhou   sh shanghai shenzhen      All
date
2013-01-02 00:00:00       0.0  0.0      0.0      0.0   1200.0
2013-01-03 00:00:00       0.0  0.0      0.0      0.0      NaN
2013-01-04 00:00:00    2133.0  0.0      0.0      0.0   2133.0
2013-01-05 00:00:00       0.0  0.0      0.0   5433.0   5433.0
2013-01-06 00:00:00       0.0  0.0      0.0      0.0      NaN
2013-01-07 00:00:00       0.0  0.0      0.0      0.0   4432.0
All                    2133.0  NaN      NaN   5433.0  13198.0

In [136]:
#简单的数据采样

In [137]:
#手动设置采样权重

In [138]:
#采样后不放回

In [277]:
#数据表描述性统计
df.describe().round(2).T

C:\Program Files\Anaconda3\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

       count    mean      std     min      25%     50%      75%     max
id       6.0  1003.5     1.87  1001.0  1002.25  1003.5  1004.75  1006.0
age      6.0    36.5    10.88    23.0    32.00    33.0    41.50    54.0
price    4.0  3299.5  1966.64  1200.0      NaN     NaN      NaN  5433.0

In [140]:
#标准差

In [141]:
#两个字段间的协方差

In [279]:
#数据表中所有字段间的协方差
df.corr()

             id       age     price
id     1.000000 -0.034401  0.792239
age   -0.034401  1.000000 -0.086895
price  0.792239 -0.086895  1.000000

In [143]:
#相关性分析

In [144]:
#数据表相关性分析

In [145]:
#输出到Excel格式

In [146]:
#输出到CSV格式